# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],                       #40
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32   #20
   [-1, 3, C3, [1024]],
   [-1, 1, C3CASM, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 10
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 14                    #40

   [-1, 1, Conv, [256, 1, 1]],     #40         15
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],          #80
#   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
#   [-1, 3, C3, [256, False]],  # 18 (P3/8-small)    标记1   80
#
#   [-1, 1, Conv, [256, 3, 2]],                  #40  ---1   19
   [[-1, 15], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 21 (P4/16-medium)   16    标记2   40

   [[-1, 15], 1, Concat, [1]],  # cat head P4   40  ---1   22


   [-1, 1, Conv, [512, 3, 2]],     #23               ----2
   [[-1, 11], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 25 (P5/32-large)    19   标记3 20    ---3

   [19, 1, Conv, [512, 3, 2]],     #  ----2   20     26

   [[-1, 23, 25], 1, Concat, [1]],  # cat head P5    27    ---2     512


   #3层不同输出做SPPF
   [27, 1, SPPF, [1024, 5]],  # 28
   [22, 1, SPPF, [512, 5]],  # 29
   [18, 1, SPPF, [256, 5]],  # 30


   #Neck-2

   [28, 1, Conv, [512, 1, 1]],   #20   31
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            #40
   [[-1, 29], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],    #34  40

   [-1, 1, Conv, [256, 1, 1]],    #35  40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #80
   [[-1, 30], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 38 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],    #39     40
   [[-1, 29], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 41 (P4/16-medium)

   [-1, 1, CAFMAttention, [512]],  #42

   [-1, 1, Conv, [512, 3, 2]],  #43     20
   [[-1, 28], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [1024, False]],  # 45 (P4/16-medium)      20
#   [-1, 1, CAFMAttention, [1024]],  #46


   [[38, 42, 45], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
